Terraform plan in __terraform__
<details>
  <summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_initWatch_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_initWatch_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/initWatch"
        name                  = "initWatch"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#1ada452a9c63bba7c46664c4142f99c9"
        # (14 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#1ada452a9c63bba7c46664c4142f99c9"
        # (14 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#1ada452a9c63bba7c46664c4142f99c9"
        # (14 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_onNewMessage_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_onNewMessage_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/onNewMessage"
        name                  = "onNewMessage"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#1ada452a9c63bba7c46664c4142f99c9"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#440c12a9d5803e4259fc5e6f5693fbc7"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "d7bZoA==" -> (known after apply)
      ~ detect_md5hash = "MwjzYmWk0+rx83b+O+ZWfA==" -> "different hash" # forces replacement
      ~ id             = "******************************************************************************" -> (known after apply)
      ~ md5hash        = "MwjzYmWk0+rx83b+O+ZWfA==" -> (known after apply)
      ~ name           = "gmail_notifier.zip#3308f36265a4d3eaf1f376fe3be6567c" -> "gmail_notifier.zip#1ada452a9c63bba7c46664c4142f99c9" # forces replacement
      ~ output_name    = "gmail_notifier.zip#3308f36265a4d3eaf1f376fe3be6567c" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%233308f36265a4d3eaf1f376fe3be6567c" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

Plan generated in [Create terraform plan #45](https://github.com/Zenika/lilaobot/actions/runs/1286433678)